curl/soap/xmlSamples/GetNextPredictedArrivalTimeAtStopsForTramNo.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <PidsClientHeader xmlns="http://www.yarratrams.com.au/pidsservice/">
      <ClientGuid>00000000-0000-0000-0000-000000000000</ClientGuid>
      <ClientType>WEBPID</ClientType>
      <ClientVersion>1.0.0</ClientVersion>
      <ClientWebServiceVersion>6.4.0.0</ClientWebServiceVersion>
      <OSVersion>1.0</OSVersion>
    </PidsClientHeader>
  </soap:Header>
  <soap:Body>
    <GetNextPredictedArrivalTimeAtStopsForTramNo xmlns="http://www.yarratrams.com.au/pidsservice/">
      <tramNo>2047</tramNo>
    </GetNextPredictedArrivalTimeAtStopsForTramNo>
  </soap:Body>
</soap:Envelope>